IDENTIFICATION DIVISION.
PROGRAM-ID. COBOL-INPUT.
AUTHOR. István Beregszászi.
DATE-WRITTEN. September 30, 2023
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 UserName PIC X(15).

PROCEDURE DIVISION.
DISPLAY 'Enter your name:'.
    ACCEPT UserName
    DISPLAY "Welcome, " UserName
STOP RUN.
